xml/request/holdings.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openruth">
   <soapenv:Header/>
   <soapenv:Body>
      <open:holdingsRequest>
         <open:agencyId>?</open:agencyId>
         <!--Optional:-->
         <open:showComingCopies>?</open:showComingCopies>
         <!--1 or more repetitions:-->
         <open:itemId>?</open:itemId>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:holdingsRequest>
   </soapenv:Body>
</soapenv:Envelope>
