xml/request/agencyCounters.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openruth">
   <soapenv:Header/>
   <soapenv:Body>
      <open:agencyCountersRequest>
         <!--1 or more repetitions:-->
         <open:agencyId>?</open:agencyId>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:agencyCountersRequest>
   </soapenv:Body>
</soapenv:Envelope>
