xml/request/updateUserInfo.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openruth">
   <soapenv:Header/>
   <soapenv:Body>
      <open:updateUserInfoRequest>
         <open:agencyId>?</open:agencyId>
         <open:userId>?</open:userId>
         <open:userPinCode>?</open:userPinCode>
         <!--Optional:-->
         <open:userPinCodeNew>?</open:userPinCodeNew>
         <!--Optional:-->
         <open:userEmail>?</open:userEmail>
         <!--Optional:-->
         <open:userMobilePhone>?</open:userMobilePhone>
         <!--Optional:-->
         <open:userPreReturnReminder>?</open:userPreReturnReminder>
         <!--Optional:-->
         <open:userFirstName>?</open:userFirstName>
         <!--Optional:-->
         <open:userLastName>?</open:userLastName>
         <!--Optional:-->
         <open:userAbsenceStartDate>?</open:userAbsenceStartDate>
         <!--Optional:-->
         <open:userAbsenceEndDate>?</open:userAbsenceEndDate>
         <!--Optional:-->
         <open:agencyCounter>?</open:agencyCounter>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:updateUserInfoRequest>
   </soapenv:Body>
</soapenv:Envelope>
