xml/request/orderItem.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openruth"><SOAP-ENV:Body>
<ns1:orderItemRequest>
  <ns1:agencyId>010100</ns1:agencyId>
  <ns1:userId>??</ns1:userId>
  <ns1:orderNote>This is an order note</ns1:orderNote>
  <ns1:orderLastInterestDate>2011-01-25</ns1:orderLastInterestDate>
  <ns1:agencyCounter>??</ns1:agencyCounter>
  <ns1:orderOverRule>??</ns1:orderOverRule>
  <ns1:orderPriority>??</ns1:orderPriority>
  <ns1:orderType>??</ns1:orderType>
  <ns1:orderItemId>??</ns1:orderItemId>
</ns1:orderItemRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>

