xml/request/updateOrder.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openruth"><SOAP-ENV:Body>
<ns1:updateOrderRequest>
  <ns1:agencyId>010100</ns1:agencyId>
  <ns1:orderId>??</ns1:orderId>
  <ns1:orderNote>This is an order note</ns1:orderNote>
  <ns1:orderLastInterestDate>2011-01-25</ns1:orderLastInterestDate>
  <ns1:agencyCounter>??</ns1:agencyCounter>
</ns1:updateOrderRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>

